Autodesk.Revit.DB.Architecture.RailTagentJoinOption
The tangent joins of the rails.
Since:
2013

Autodesk.Revit.DB.Architecture.RailTagentJoinOption.ExtendRailsToMeet
Extend rails to meet.

Autodesk.Revit.DB.Architecture.RailTagentJoinOption.NoConnector
No connector.

Autodesk.Revit.DB.Architecture.RailTagentJoinOption.AddVerticalOrHorizontalSegments
Add vertical or horizontal segments.